const help = [
    {
        id: 'root',
        title: 'Помощь',
        text: 'Помощь в понимании непонятного.'
    },
    {
        id: 'signup',
        title: 'Регистрация',
        text: 'Для регистрации откройте окно "Аккаунт" на рабочем столе, после нажмите кнопку "Регистрация" в нижней панели окна. Введите ваши данные и нажмите "Отправить".'
    },
    {
        id: 'login',
        title: 'Вход',
        text: 'Для входа откройте окно "Аккаунт" на рабочем столе. Введите ваши данные и нажмите "Отправить".'
    },
    {
        id: 'restore',
        title: 'Восстановление пароля',
        text: 'Пока недоступно'
    },
    {
        id: 'player',
        title: 'Управление плеером',
        text: 'Для управления плеером откройте окно "Слушать" или выберите любой трек двойным щелчком (двойным тапом на сенсорных экранах).' +
            'Для управления воспроизведением используйте кнопки внизу. Если вы авторизованы, вы также можете добавить трек в плейлист.' +
            'Если вы считаете, что трек нарушает правила сервиса, нажмите кнопку "Пожаловаться". Вы также можете открыть очередь воспроизведения ' +
            'нажатием на кнопку "Очередь".'
    },
    {
        id: 'queue',
        title: 'Очередь воспроизведения',
        text: 'Открывается после нажатия на кнопку "Очередь". Вы можете добавлять треки в перетаскиванием иконки в список треков в очереди, либо ' +
            'добавить целый плейлист нажатием соответствующей кнопки в окне плейлиста. Удалить трек из очереди можно нажатием на крестик слева от трека.' +
            ' Можно переключиться на другой трек из списка нажатием на него двойным щелчком (двойным тапом)'
    },
    {
        id: 'playlist:create',
        title: 'Создание плейлиста',
        text: 'Каждый зарегистрированный пользователь может создавать плейлисты. Чтобы создать, откройте окно "Библиотека" на рабочем столе ' +
            'и нажмите соответствующую кнопку. После заполните форму и нажмите "Отправить"'
    },
    {
        id: 'playlist:edit',
        title: 'Редактирование плейлиста',
        text: 'Если у вас есть права на редактирование плейлиста, нажмите на кнопку "Изменить" в окне плейлиста. Введите новое имя, измените приватность ' +
            'или удалите треки. После нажмите на кнопку "Сохранить", чтобы применить изменения.'
    },
    {
        id: 'playlist:save',
        title: 'Сохранение плейлиста',
        text: 'Если вы вошли в аккаунт, вы можете сохранить плейлист себе в библиотеку. Откройте желаемый плейлист и нажмите на кнопку "Сохранить в библиотеку".' +
            ' Плейлист появится в библиотеке и вы можете его просмотреть в любое время.'
    },
    {
        id: 'playlist:addTrack',
        title: 'Добавление трека в плейлист',
        text: 'Если у вас есть права на редактирование плейлиста, вы можете добавлять в него треки. '+
            'Чтобы перенести трек из навигатора, перетащите его в окно плейлиста, где находятся треки, '+
            'или на соответствующий плейлист (папку) в библиотеке. ' +
            'Также можно добавить прослушиваемый трек, нажав на кнопку "Добавить в плейлист" в плеере. После загрузки доступных плейлистов ' +
            'дважды щелкните (тапните) по желаемому плейлисту.'
    },
    {
        id: 'playlist:removeTrack',
        title: 'Удаление трека из плейлиста',
        text: 'Если у вас есть права на редактирование плейлиста, вы можете удалять треки из него. ' +
            'Чтобы удалить трек, нажмите на кнопку "Изменить" в плейлисте. После нажмите на крестик справа от трека.'
    },
    {
        id: 'playlist:remove',
        title: 'Удаление плейлиста',
        text: 'Чтобы удалить плейлист из библиотеки, нажмите на кнопку "Удалить" в окне плейлиста. ' +
            'Если вы создатель плейлиста, плейлист будет удален из вашей библиотеки, но будет доступен остальным пользователям, которые сохранили его ' +
            'в свою библиотеку. Однако он будет автоматически скрыт из публичного доступа.'
    },
    {
        id: 'track:upload',
        title: 'Загрузка треков',
        text: 'Если вы прошли проверку и стали экспертом, вы можете загружать новые треки в сервис. Чтобы загрузить трек откройте окно загрузки треков ' +
            'на рабочем столе. Выберите нужные файлы и нажмите "Загрузить".'
    },
    {
        id: 'mobile',
        title: 'Мобильная версия',
        text: 'Все клики меняются на тапы: чтобы открыть окно, дважды тапните по нему. Аналогично с другими случаями. Чтобы перетащить трек/плейлист ' +
            'зажмите на некоторое время заголовок ярлыка (не картинку) и перетащите его в нужное место.'
    }
]

export default help