const help = [
    {
        id: 'root',
        title: 'Помощь',
        text: 'Помощь в понимании непонятного.'
    },
    {
        id: 'signup',
        title: 'Регистрация',
        text: 'Для регистрации откройте окно "Аккаунт" на рабочем столе, после нажмите кнопку "Регистрация" в нижней панели окна. Введите ваши данные и нажмите "Отправить".'
    },
    {
        id: 'login',
        title: 'Вход',
        text: 'Для входа откройте окно "Аккаунт" на рабочем столе. Введите ваши данные и нажмите "Отправить".'
    },
    {
        id: 'restore',
        title: 'Восстановление пароля',
        text: 'Пока недоступно'
    },
    {
        id: 'player',
        title: 'Управление плеером',
        text: 'Для управления плеером откройте окно "Слушать" или выберите любой трек двойным щелчком (двойным тапом на сенсорных экранах).' +
            'Для управления воспроизведением используйте кнопки внизу. Если вы авторизованы, вы также можете добавить трек в плейлист.' +
            'Если вы считаете, что трек нарушает правила сервиса, нажмите кнопку "Пожаловаться". Вы также можете открыть очередь воспроизведения ' +
            'нажатием на кнопку "Очередь".'
    },
    {
        id: 'queue',
        title: 'Очередь воспроизведения',
        text: 'Открывается после нажатия на кнопку "Очередь". Вы можете добавлять треки в перетаскиванием иконки в список треков в очереди, либо ' +
            'добавить целый плейлист нажатием соответствующей кнопки в окне плейлиста. Удалить трек из очереди можно нажатием на крестик слева от трека.' +
            ' Можно переключиться на другой трек из списка нажатием на него двойным щелчком (двойным тапом)'
    }
]

export default help